Фрэймворк - это набор готовых библиотек и готовых модулей, типа панель администратора, набор регистрации пользователей и т.д.
Django - это готовый фреймворк, с огромным набором библиотек

 - HTTP запрос бывает 2-х видов: Get и Post. В себе они содержат голову (Head) и тело (Body)
 - Для получения инфы с сервера используется Get запрос
 - Для обновления инфы на сервере используется Post запрос
 - Host - Указывет, к какому веб приложению нужно обратится на сервере
 - User-agent - говорит с какого браузера и устройства обращается клиент
 - Accept - говорит о том, какой язык может понять клиент